transient/mid/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../../nozzleDict"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 $Uinit);

boundaryField
{
    jetInlet
    {
        type         fixedValue;
        value        uniform (0 0 $Ujetin);
    }
    jetOutlet
    {
        type         fixedValue;
        value        uniform (0 0 $Ujetout);
    }
    airInlet
    {
        type                inletOutlet;
        inletValue          $internalField;
        value               uniform (0 0 0);
        phi                 phi;
    }
    airOutlet
    {
        type                inletOutlet;
        inletValue          uniform (0 0 0);
        value               uniform (0 0 0);
        phi                 phi;
    }
    walls
    {
        type            noSlip;
    }
    fastWalls
    {
        type            noSlip;
    }
    top
    {
        type                outletInlet;
        outletValue         uniform (0 0 0);
        value               uniform (0 0 0);
        phi                 phi;
    }
    axis
    {
        type            empty;
    }
    sideA
    {
        type            wedge;
    }
    sideB
    {
        type            wedge;
    }
}


// ************************************************************************* //
