transient/mid/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

epValue 50;

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform $epValue;

boundaryField
{
    jetInlet
    {
        type            inletOutlet;
        inletValue      uniform $epValue;
        value           uniform $epValue;
    }
    jetOutlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.5;
        value           uniform $epValue;
    }
    airInlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.2;
        value           uniform $epValue;
    }
    airOutlet
    {
        type            inletOutlet;
        inletValue      uniform $epValue;
        value           uniform $epValue;
    }
    walls
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform $epValue;
    }
    fastWalls
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform $epValue;
    }
    top
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.2;
        value           uniform $epValue;
    }
    axis
    {
        type            empty;
    }
    sideA
    {
        type            wedge;
    }
    sideB
    {
        type            wedge;
    }
}


// ************************************************************************* //
