transient/mid/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitTemperature
{
	type limitTemperature;
	active true;
	limitTemperatureCoeffs
	{
		selectionMode all;
		min 1;
		max 50000;
	}
}

limitp
{
    type       limitPressure;

    minFactor  0.1;
    maxFactor  2;
}

// ************************************************************************* //
